
// ----------------------------------------------------------------------------

// скрипты, специфичные для приложения

// ----------------------------------------------------------------------------

// настройка события загрузки страницы на слушателя этого события
window.addEventListener('load', handler, false);

// ----------------------------------------------------------------------------

// обработчик события загрузки страницы
function handler() {

    // приветствие
    console.log("* --------------------------- *");
    console.log("* -- Привет, пользователь  -- *");
    console.log("* --------------------------- *");
    console.log("* -- Приложение работает!  -- *");
    console.log("* --------------------------- *");

    // заполнение данных о текущем годе в "подвале" страницы
    $('#id-todayYear').text(`${new Date().getFullYear()}`);

} // handler

// ----------------------------------------------------------------------------