// ----------------------------------------------------------------------------
// ----------------------------------------------------------------------------

// вспомогательные функции

// ----------------------------------------------------------------------------

// генерация случайного вещественного числа
// !!! диапазон [min, max] !!!
function getRand(min, max) {

    return Math.random() * (max - min + 1) + min;

} // getRandom

// ----------------------------------------------------------------------------

// генерация случайного целого числа
// !!! диапазон [min, max] !!!
function getIntRand(min, max) {

    min = Math.ceil(min);
    max = Math.floor(max);

    return Math.floor(Math.random() * (max - min + 1) + min);

} // getIntRand

// ----------------------------------------------------------------------------

// функция для преобразования даты к формату / dd*MM*YYYY или dd*MM*YY /
// где * - разделитель
// или
// дата в формате: DD.MM.YY - new Date().toISOString().slice(0,10).split('-').reverse().join('.') => "2024-07-02T08:46:37.808Z" => "02.07.2024" ! но UTC-0
// дата в формате: DD.MM.YY - new Date().toLocaleString().slice(0,10) => "02.07.2024, 11:46:37" => "02.07.2024"
// console.log(`${new Date().toLocaleDateString("ru-RU")}`); => "02.07.2024"
// console.log(`${new Date().toLocaleTimeString("ru-RU")}`); => "11:46:37"
// console.log(`${new Date().toLocaleString().slice(0, 10).split('.').reverse().join('-') }`); => "2024-07-02"

// ----------------------------------------------------------------------------